[{"id": 991, "name": "Halo 4", "platforms": [6, 12, 49], "summary": "Halo 4 marks the start of an epic new saga within the award-winning Halo universe. The Master Chief returns in this award-winning first-person shooter developed by 343 Industries. Shipwrecked on a mysterious world, faced with new enemies and deadly technology, the Chief returns to battle against an ancient evil bent on vengeance and annihilation...the universe will never be the same.", "total_rating": 83.08520139693795}, {"id": 987, "name": "Halo 3", "platforms": [6, 12, 49], "summary": "Halo 3 is a shooter game where players primarily experience gameplay from a first-person perspective. Much of the gameplay takes place on foot, but also includes segments focused on vehicular combat. The balance of weapons and objects in the game was adjusted to better adhere to the \"Golden Triangle of Halo\": these are weapons, grenades, and melee attacks, which are available to a player in most situations. Players may dual-wield some weapons, forgoing the use of grenades and melee attacks in favor of the combined firepower of two weapons. Many weapons available in previous installments of the series return with minor cosmetic and power alterations. Unlike previous installments, the player's secondary weapon is visible on their player model, holstered or slung across the player's back.\nHalo 3 introduces \"support weapons\", which are cumbersome two-handed weapons that slow the player, but offer greatly increased firepower in return. In addition to weapons, the game contains a new class of gear called equipment; these items have various effects, ranging from defensive screens to shield regeneration and flares. Only one piece of equipment can be carried at a time. The game's vehicular component has been expanded with new drivable and AI-only vehicles.", "total_rating": 88.14395100889934}, {"id": 119402, "name": "The Witcher 3: Wild Hunt - Complete Edition", "platforms": [6, 48, 49, 130, 167, 169], "summary": "The Witcher 3: Wild Hunt is a story-driven, open world adventure set in a dark fantasy universe. You are Geralt of Rivia, mercenary monster slayer. At your disposal is every tool of the trade: razor-sharp swords, lethal mixtures, stealthy crossbows, and powerful combat magic. Before you stands a war-torn, monster-infested continent you can explore at will. Your current contract? Tracking down the Child of Prophecy, a living weapon that can alter the shape of the world. The Complete Edition contains every piece of downloadable content released for the game, including two massive story expansions: Hearts of Stone & Blood and Wine. It's the perfect opportunity to enter this world for the first time or relive the adventure – on the go!", "total_rating": 93.27822860911157}, {"id": 986, "name": "Halo 2", "platforms": [6, 11, 49], "summary": "Halo 2 is the sequel to the highly successful and critically acclaimed Halo: Combat Evolved. In Halo 2, the saga continues as Master Chief—a genetically enhanced super-soldier—is the only thing standing between the relentless Covenant and the destruction of all humankind.", "total_rating": 82.51052963420152}, {"id": 2155, "name": "Dark Souls", "platforms": [6, 9, 12], "summary": "An action RPG and spiritual sequel to Demon's Souls in which the player embodies the Chosen Undead, who is tasked with fulfilling an ancient prophecy by ringing the Bells of Awakening in the dark fantasy setting of Lordran, an open world with intricate areas full of beasts, former humans gone hollow, and magical abominations whom the player must overcome in challenging and unforgiving combat.", "total_rating": 89.0016095333516}, {"id": 1022, "name": "The Legend of Zelda", "platforms": [5, 18, 37, 41, 51, 99], "summary": "The Legend of Zelda is the first title in the Zelda series, it has marked the history of video games particularly for it's game mechanics and universe. The player controls Link and must make his way through the forests, graveyards, plains and deserts of the Otherworld to find the secret entrances to the eight dungeons and try to restore the broken Triforce. Among the game's mechanics, it was the first time we saw a continuous world that could be freely explored, power-ups that permanently enhanced the main character's abilities and a battery save feature that allowed players to keep their progress instead of having to start over. The gameplay balanced action sequences with discovery, secrets and exploration.", "total_rating": 81.22137541176696}, {"id": 121, "name": "Minecraft", "platforms": [3, 6, 14], "summary": "Minecraft focuses on allowing the player to explore, interact with, and modify a dynamically-generated map made of one-cubic-meter-sized blocks. In addition to blocks, the environment features plants, mobs, and items. Some activities in the game include mining for ore, fighting hostile mobs, and crafting new blocks and tools by gathering various resources found in the game. The game's open-ended model allows players to create structures, creations, and artwork on various multiplayer servers or their single-player maps. Other features include redstone circuits for logic computations and remote actions, minecarts and tracks, and a mysterious underworld called the Nether. A designated but completely optional goal of the game is to travel to a dimension called the End, and defeat the ender dragon.", "total_rating": 84.28730383871022}, {"id": 42931, "name": "Bloodborne: Game of the Year Edition", "platforms": [48], "summary": "With new story details, learn the tale of hunters who once made Yharnam their hunting grounds, meet new NPCs, and discover another side of the history and world of Bloodborne. Includes:\nThe Original Bloodborne Experience / Bloodborne: The Old Hunters Expansion / Bloodborne: The Old Hunters", "total_rating": 97.10231895596941}, {"id": 128, "name": "Assassin's Creed", "platforms": [6, 9, 12], "summary": "Assassin's Creed is a non-linear action-adventure video game, during which the player controls a 12th-century Levantine Assassin named Altaïr Ibn-La'Ahad during the Third Crusade, whose life is experienced through the Animus by his 21st century descendant, Desmond Miles.", "total_rating": 77.09342378912235}, {"id": 621, "name": "Call of Duty", "platforms": [6, 9, 12, 14, 42], "summary": "The player has two primary weapon slots, a handgun slot and can carry up to eight grenades (all of the later Call of Duty games feature only two weapon slots; a sidearm will fill one of these slots). Weapons may be exchanged with those found on the battlefield dropped by dead soldiers.", "total_rating": 84.28936559686196}, {"id": 45131, "name": "Grand Theft Auto V: Special Edition", "platforms": [9, 12], "summary": "The Grand Theft Auto V Special Edition includes: Full retail copy of Grand Theft Auto V; Collectible SteelBook with Exclusive Artwork - features custom color and metallic treatments to bring out the detail of the Michael, Trevor and Franklin artwork created exclusively for this SteelBook; Blueprint Map - exclusive, 21.5” x 26.75” map displays a blueprint view of Los Santos and Blaine County; Special Ability Boost - Michael, Franklin and Trevor each have a unique special ability. With this boost, the special ability bar will generate 25% faster; Stunt Plane Trials – single-player Stunt Plane Trials let players take on additional aerial challenges spread throughout Los Santos and Blaine County; Bonus Outfits, Tattoos and More - Michael, Franklin and Trevor get bonus outfits in their wardrobes, character specific tattoos at tattoo parlors, and special deals from shopkeepers across Los Santos and Blaine County; Additional Weapons - when visiting Ammunation stores in single-player, merchants will have special weapons in their inventory available for free: the Pistol .50, Bullpup Shotgun and melee Hammer.\n\nGrand Theft Auto V is the largest and most ambitious game Rockstar Games has yet created, and takes full advantage of every ounce of processing power available in the current generation of consoles. In order to provide the best possible experience for such a massive and detailed world, the game will have installation requirements on the Xbox 360.\n\nGrand Theft Auto V will ship on two discs; Disc 1 will be used for a one-time mandatory install and Disc 2 will be used to play the game. After the install, players will be able to enjoy both Grand Theft Auto V and Grand Theft Auto Online without any need to switch discs.\n\nThis initial install will require an Xbox 360 Hard Drive or an external 16GB USB flash drive (sold separately) with at least 8 GB of free space. If using a USB flash drive it must be at least USB 2.0 with a minimum 15mb/s read speed and formatted for Xbox 360 use. A new USB flash drive is recommended to ensure optimum performance.", "total_rating": 99.54327652183188}]
